/**
 * Created by Mac_Li on 2017/9/1.
 */

/**
 * 文字配置文件
 *
 */

 var jlmj_strConfig = {
    /**
     * 1 平胡
     * 2 放炮
     * 3 自摸
     * 4 夹胡
     * 5 摸宝
     * 6 对宝
     * 7 飘胡
     * 8 庄胡
     * 9 立胡
     * 10 七对
     * 11 豪七
     * 12 双豪七
     * 13 至尊豪七
     * 14 清一色
     * 15 手把一
     * 16 边胡
     * 17 杠上花
     * 18 天胡
     * 19 抢杠胡
     */
    hupaiType: ['0', '平胡', '胡', '自摸', '夹胡', '摸宝', '对宝', '飘胡', '庄', '站立', '七对', '豪七', '双豪七', '至尊豪七', '清一色', '手把一',
        '边胡', '杠上花', '天胡', '抢杠胡','潇洒','流泪','单吊飘胡','夹五','砍对宝'],
    hupaiSuiHuaType: ['0', '平胡', '胡', '自摸', '夹胡', '摸宝', '宝中宝', '飘胡', '庄', '门清', '七对', '豪七', '双豪七', '至尊豪七', '清一色', '手把一',
        '边胡', '杠上花', '天胡', '抢杠胡','地胡','宝中宝','开牌炸','刮大风','亮掌宝', '三道喜天胡', '红中满天飞', '三砍'],
    hupaiJinZhouType:['0', '平胡', '胡', '自摸', '夹胡', '摸宝', '对宝', '飘胡', '庄', '站立', '七对', '豪七', '双豪七', '至尊豪七', '清一色', '手把一',
        '边胡', '杠上花', '天胡', '抢杠胡','地胡','杠上炮','海底捞月','单飘','双飘', '穷胡', '独门胡', '四归一', '大哥大', '一条龙', '十三幺', '混一色', '清摸'],
    hupaiBaiChengType:['0', '平胡', '胡', '自摸', '夹胡', '摸宝', '对宝', '飘胡', '庄', '站立', '七对', '豪七', '双豪七', '至尊豪七', '清一色', '手把一',
        '边胡', '杠上花', '天胡', '抢杠胡','鸡胡','带鸡','单飘','夹五'],
    tingStr: ['未听牌', '已听牌'],

    roomRule: {
        name:['房费\n', '\n锅底\n', '\n玩法\n'],
        fangfei: ['房主支付', '均摊房费'],
        guodi: ['50锅底-16封顶', '100锅底-32封顶', '200锅底-64封顶', '不逛锅 32封顶', '不逛锅 64封顶'],
        wanfa: ['点炮包三家 ', '幺九蛋 ', '小鸡飞蛋 ', '快宝 ', '幺鸡万能宝 ', '幺九蛋顶三色 '],
    },

    fangwei:[
        ['自己','对家'],
        ['自己','下家','上家'],
        ['自己','下家','对家','上家'],
    ],

    xiangqing:['对局详情','返回'],
};


 module.exports=jlmj_strConfig;