/**
 * Created by yons on 2018/3/29.
 */
/**
 * 胡牌类型
 * @type {{PING_HU: number, FANG_PAO: number, ZI_MO: number, JIA_HU: number, MO_BAO: number, DUI_BAO: number, PIAO_HU: number, ZHUANG_HU: number, LI_HU: number, QI_DUI: number, HAO_QI: number, SHUANG_HAO_QI: number, ZHIZUN_HAO_QI: number, QING_YI_SE: number, SHOU_BA_YI: number, BIAN_HU: number, GANG_HUA_HU: number, TIAN_HU: number, QIANG_HU: number}}
 */
var HuType = {
    PING_HU: 1,            // 平胡(+1)
    FANG_PAO: 2,            // 放炮(+1)
    ZI_MO: 3,            // 自摸(+1)
    JIA_HU: 4,            // 夹胡(+1)
    MO_BAO: 5,            // 摸宝(+1)
    DUI_BAO: 6,            // 对宝(+2)
    PIAO_HU: 7,            // 飘胡(+3)
    ZHUANG_HU: 8,            // 庄胡(+1)
    LI_HU: 9,            // 立胡/门清(+1)
    QI_DUI: 10,           // 七对(封顶)
    HAO_QI: 11,           // 豪七(封顶)
    SHUANG_HAO_QI: 12,           // 双豪七(封顶)
    ZHIZUN_HAO_QI: 13,           // 至尊豪七(封顶)
    QING_YI_SE: 14,           // 清一色(+1)
    SHOU_BA_YI: 15,			// 手把一(+1)
    BIAN_HU: 16,			// 边胡(+2)
    GANG_HUA_HU: 17,			// 杠上花(+1)
    TIAN_HU: 18,			// 天胡(封顶)
    QIANG_HU: 19,			// 抢杠胡(+1)
    XIAO_SA: 20,              //潇洒，绥化地胡
    GANG_PAO_HU: 21,         //杠上炮，绥化漏宝
    DANDIAO_PIAOHU:22,      // 单吊飘胡
    JIA5_HU :23,            //掐心五
    KANDUI_BAO:24,          //砍对宝
    JIANG_DUI:25,           //将对：加2番，带2、5、8的对对胡。
    QUAN_19:26,             //全幺九
    ZHONG_ZHANG:27,         //中张
    DI_HU:28,               //地胡
    HAIDI_LAO:29,           //海底捞
    HAIDI_PAO:30,           //海底炮
    HUN_YI_SE:31,           //混一色
    QING_MO:32,           //清摸
};

var HuTypeDesc = {
    1:      "平胡",
    2:      "放炮",
    3:      "自摸",
    4:      "夹胡",
    5:      "摸宝",
    6:      "对宝",
    7:      "飘胡",
    8:      "庄胡",
    9:      "门清",
    10:      "七对",
    11:      "豪七",
    12:      "双豪七",
    13:      "至尊豪七",
    14:      "清一色",
    15:      "手把一",
    16:      "边胡",
    17:      "杠上花",
    18:      "天胡",
    19:      "抢杠胡",
    20:      "潇洒",
    21:      "杠上炮",
    22:     "单吊飘胡",
    23:      "夹5胡",
    24:      "砍对宝",
    25:      "将对",
    26:      "全幺九",
    27:      "中张",
    28:      "地胡",
    29:      "海底捞",
    30:      "海底炮",
};

var SCHuTypeDesc = {
    1:      "平胡",
    2:      "点炮",
    3:      "自摸",
    4:      "夹胡",
    5:      "摸宝",
    6:      "对宝",
    7:      "对对胡",
    8:      "庄胡",
    9:      "门清",
    10:      "七对",
    11:      "龙七对",
    12:      "龙七对",
    13:      "龙七对",
    14:      "清一色",
    15:      "金钩钓",
    16:      "边胡",
    17:      "杠上花",
    18:      "天胡",
    19:      "抢杠胡",
    20:      "潇洒",
    21:      "杠上炮",
    22:     "金钩钓",
    23:      "夹5胡",
    24:      "砍对宝",
    25:      "将对",
    26:      "全幺九",
    27:      "中张",
    28:      "地胡",
    29:      "海底捞",
    30:      "海底炮",
    31:      "夹心五",
    32:      "一条龙",
};

var SHHuTypeDesc = {
    1:      "平胡",
    2:      "放炮",
    3:      "自摸",
    4:      "夹胡",
    5:      "摸宝",
    6:      "对宝",
    7:      "飘胡",
    8:      "庄胡",
    9:      "门清",
    10:      "七对",
    11:      "豪七",
    12:      "双豪七",
    13:      "至尊豪七",
    14:      "清一色",
    15:      "手把一",
    16:      "边胡",
    17:      "杠上花",
    18:      "天胡",
    19:      "抢杠胡",
    20:      "地胡",
    21:      "漏宝",
    22:      "开牌炸",
    23:      "刮大风",
    24:      "亮掌"
};

var JZHuTypeDesc = {
    1:      "平胡",
    2:      "放炮",
    3:      "自摸",
    4:      "夹胡",
    5:      "摸宝",
    6:      "对宝",
    7:      "飘胡",
    8:      "庄胡",
    9:      "门清",
    10:      "七对",
    11:      "豪七",
    12:      "双豪七",
    13:      "至尊豪七",
    14:      "清一色",
    15:      "手把一",
    16:      "边胡",
    17:      "杠上花",
    18:      "天胡",
    19:      "抢杠胡",
    20:      "地胡",
    21:      "杠上炮",
    22:      "海底捞月",
    23:      "单飘",
    24:      "双飘",
    25:      "穷胡",
    26:      "独门胡",
    27:      "四归一",
    28:      "大哥大",
    29:      "一条龙",
    30:      "十三幺",
    31:      "混一色",
    32:      "清摸",
};

var BCHuTypeDesc = {
    1:      "平胡",
    2:      "放炮",
    3:      "自摸",
    4:      "夹胡",
    5:      "摸宝",
    6:      "对宝",
    7:      "飘胡",
    8:      "庄胡",
    9:      "背靠背",
    10:      "七对",
    11:      "豪七",
    12:      "双豪七",
    13:      "至尊豪七",
    14:      "清一色",
    15:      "手把一",
    16:      "边胡",
    17:      "杠上花",
    18:      "天胡",
    19:      "抢杠胡",
    20:      "鸡胡",
    21:      "鸡飘",
    22:      "单飘",
    23:      "夹五",
};

module.exports = {
    HuType: HuType,
    HuTypeDesc: HuTypeDesc,
    SCHuTypeDesc: SCHuTypeDesc,
    SHHuTypeDesc: SHHuTypeDesc,
    JZHuTypeDesc: JZHuTypeDesc,
};